In [ ]:
#  https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv

# 1 .print first 5 and last 7 records

import pandas as pd
df1=pd.read_table(r'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv')
df1

      order_id  ...  item_price
0            1  ...      $2.39
1            1  ...      $3.39
2            1  ...      $3.39
3            1  ...      $2.39
4            2  ...     $16.98
...        ...  ...         ...
4617      1833  ...     $11.75
4618      1833  ...     $11.75
4619      1834  ...     $11.25
4620      1834  ...      $8.75
4621      1834  ...      $8.75

[4622 rows x 5 columns]

In [ ]:
df1.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [ ]:
df1.tail(7)

      order_id  ...  item_price
4615      1832  ...      $8.75
4616      1832  ...      $4.45
4617      1833  ...     $11.75
4618      1833  ...     $11.75
4619      1834  ...     $11.25
4620      1834  ...      $8.75
4621      1834  ...      $8.75

[7 rows x 5 columns]

In [ ]:
#2. print total records and type of variables

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [ ]:
#3. Print the name of all the columns
print(list(df1.columns))

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [ ]:
#4. How is the dataset indexed?
df1.index

RangeIndex(start=0, stop=4622, step=1)

In [ ]:
#5. Which was the most ordered item? and How many items were ordered?
grpdf=df1.groupby('item_name')
grpdf=grpdf.sum()
grpdf=grpdf.sort_values('quantity',ascending=False)
grpdf.head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

In [ ]:
#6. What was the most ordered item in the choice_description column?
gdf=df1.groupby('choice_description')
gdf=gdf.sum()
gdf=gdf.sort_values('quantity',ascending=False)
gdf.head(1)

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

In [ ]:
#7 Turn the item price into a float
def num_float(x):
    return float(x[1:-1])

df1.item_price = df1.item_price.apply(num_float)

df1.dtypes

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

In [ ]:
#8.print a data frame with only two columns item_name and item_price

df2=df1[['item_name','item_price']]
df2

                                  item_name  item_price
0              Chips and Fresh Tomato Salsa        2.39
1                                      Izze        3.39
2                          Nantucket Nectar        3.39
3     Chips and Tomatillo-Green Chili Salsa        2.39
4                              Chicken Bowl       16.98
...                                     ...         ...
4617                          Steak Burrito       11.75
4618                          Steak Burrito       11.75
4619                     Chicken Salad Bowl       11.25
4620                     Chicken Salad Bowl        8.75
4621                     Chicken Salad Bowl        8.75

[4622 rows x 2 columns]

In [ ]:
#9. delete the duplicates in item_name and quantity
df2=df1.drop_duplicates(['quantity','item_name'])
df2

      order_id  ...  item_price
0            1  ...        2.39
1            1  ...        3.39
2            1  ...        3.39
3            1  ...        2.39
4            2  ...       16.98
...        ...  ...         ...
3890      1559  ...       17.98
3973      1592  ...        5.00
4152      1660  ...       15.00
4354      1738  ...       18.50
4489      1786  ...       17.80

[103 rows x 5 columns]

In [ ]:
#10. select only the products with quantity equals to 1

df10=df1[df1['quantity']==1]
df10[['item_name','quantity']]

                                  item_name  quantity
0              Chips and Fresh Tomato Salsa         1
1                                      Izze         1
2                          Nantucket Nectar         1
3     Chips and Tomatillo-Green Chili Salsa         1
5                              Chicken Bowl         1
...                                     ...       ...
4617                          Steak Burrito         1
4618                          Steak Burrito         1
4619                     Chicken Salad Bowl         1
4620                     Chicken Salad Bowl         1
4621                     Chicken Salad Bowl         1

[4355 rows x 2 columns]

In [ ]:
#11. select only the item_name and item_price columns

df1[['item_name','item_price']]

                                  item_name  item_price
0              Chips and Fresh Tomato Salsa        2.39
1                                      Izze        3.39
2                          Nantucket Nectar        3.39
3     Chips and Tomatillo-Green Chili Salsa        2.39
4                              Chicken Bowl       16.98
...                                     ...         ...
4617                          Steak Burrito       11.75
4618                          Steak Burrito       11.75
4619                     Chicken Salad Bowl       11.25
4620                     Chicken Salad Bowl        8.75
4621                     Chicken Salad Bowl        8.75

[4622 rows x 2 columns]

In [ ]:
#12. sort item from the most to less expensive

df2=df1.sort_values('item_price',ascending=False)
df2

      order_id  ...  item_price
3598      1443  ...       44.25
3480      1398  ...       35.25
1254       511  ...       35.00
3602      1443  ...       35.00
3601      1443  ...       33.75
...        ...  ...         ...
3936      1578  ...        1.09
2922      1162  ...        1.09
1396       567  ...        1.09
2562      1014  ...        1.09
1457       591  ...        1.09

[4622 rows x 5 columns]

In [ ]:
#13. What was the quantity of the most expensive item ordered?

df3= df2[['item_name','quantity','item_price']].head(1)
df3

                         item_name  quantity  item_price
3598  Chips and Fresh Tomato Salsa        15       44.25

In [ ]:
#14. How many times were a Veggie Salad Bowl ordered?
 
print(df1.item_name.value_counts()['Veggie Salad Bowl'])

18